feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Scu/Std/IfxScuLbist.c
/**
 * \file IfxScuLbist.c
 * \brief SCU  basic functionality
 *
 * \version iLLD_1_0_1_12_0_1
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "IfxScuLbist.h"

/******************************************************************************/
/*-----------------------Exported Variables/Constants-------------------------*/
/******************************************************************************/

IFX_CONST IfxScuLbist_ParameterSet IfxScuLbist_defaultConfig = {
#ifndef IFX_CFG_LBIST_BODY_ENABLED
#ifndef IFX_CFG_LBIST_CFG_B_ENABLED
    .application     = IfxScuLbist_Application_pt,
    .freq            = IfxScuLbist_Freq_div6,
    .splitShiftSel   = IfxScuLbist_SplitShiftSel_fourScanPartitions,
    .seed            = IFXSCULBIST_CFG_SEED,
    .pattern         = IFXSCULBIST_CFG_PATTERN_A,
    .scanChainLength = IFXSCULBIST_CFG_SCANCHAINLENGTH,
    .signature       = IFXSCULBIST_CFG_SIGNATURE_A,
#else
    .application     = IfxScuLbist_Application_pt,
    .freq            = IfxScuLbist_Freq_div6,
    .splitShiftSel   = IfxScuLbist_SplitShiftSel_fourScanPartitions,
    .seed            = IFXSCULBIST_CFG_SEED,
    .pattern         = IFXSCULBIST_CFG_PATTERN_B,
    .scanChainLength = IFXSCULBIST_CFG_SCANCHAINLENGTH,
    .signature       = IFXSCULBIST_CFG_SIGNATURE_B,
#endif
#else
#ifndef IFX_CFG_LBIST_CFG_B_ENABLED
    .application     = IfxScuLbist_Application_body,
    .freq            = IfxScuLbist_Freq_div6,
    .splitShiftSel   = IfxScuLbist_SplitShiftSel_fourScanPartitions,
    .seed            = IFXSCULBIST_CFG_SEED,
    .pattern         = IFXSCULBIST_CFG_PATTERN_A,
    .scanChainLength = IFXSCULBIST_CFG_SCANCHAINLENGTH,
    .signature       = IFXSCULBIST_CFG_SIGNATURE_A,
#else
    .application     = IfxScuLbist_Application_body,
    .freq            = IfxScuLbist_Freq_div6,
    .splitShiftSel   = IfxScuLbist_SplitShiftSel_fourScanPartitions,
    .seed            = IFXSCULBIST_CFG_SEED,
    .pattern         = IFXSCULBIST_CFG_PATTERN_B,
    .scanChainLength = IFXSCULBIST_CFG_SCANCHAINLENGTH,
    .signature       = IFXSCULBIST_CFG_SIGNATURE_B,
#endif
#endif
};
